app/Controllers/carrito_controller.php

SELECT *
FROM `productos`
---
    public function muestra(){
        $cart = \Config\Services::Cart();
        $productoModel = new Producto_model();
        //$cart = $cart->contents();
        $data['cart'] = $cart;
        $cartItems = $cart->contents();

        $productos = new Producto_model();
        $data['productos'] = $productos->findAll();