app/Controllers/login_controller.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'yoliiArias'
 LIMIT 1
---
    public function auth(){
        $session = session();
        $model = new Usuarios_model();

        $usuario = $this->request->getVar('usuario');
        $password = $this->request->getVar('pass'); // Contraseña ingresada por el usuario

        $data = $model->where('usuario', $usuario)->first();