app/Controllers/ventas_controller.php

    public function registrar_venta(){
        $cart = \Config\Services::cart();
        $productos = $cart->contents();
        $request = \Config\Services::request();
        $montoTotal = 0;
        $db = \Config\Database::connect();
        $db->transStart();

        foreach ($productos as $producto) {
            $montoTotal += $producto["price"] * $producto["qty"];
        }

        $ventaCabecera = new Ventas_cabecera_model();
        if ($ventaCabecera->insert(["total_venta" => $montoTotal, "usuario_id" => session()->get('id_usuario')])){
            $idCabecera = $ventaCabecera->insertID();
            $ventaDetalle = new Ventas_detalle_model();
            $productoModel = new Producto_model();

            foreach ($productos as $producto) {
                if($ventaDetalle->insert(["venta_id" => $idCabecera, "producto_id" => $producto["id"], "cantidad" => $producto["qty"], "precio" => $producto["price"]])){
                    // Obtener el producto de la base de datos para obtener el stock actualizado
                    $productoDB = $productoModel->find($producto["id"]);

                    // Verificar si el producto existe en la base de datos
                    if ($productoDB && $productoDB["stock"] >= $producto["qty"]) {
                        // Actualizar el stock y las unidades vendidas
                        $nuevoStock = $productoDB["stock"] - $producto["qty"];
                        $productoModel->update($producto["id"], [
                            "stock" => $nuevoStock
                        ]);
---
INSERT INTO `ventas_cabeceras` (`total_venta`, `usuario_id`) VALUES (19850, '11')
INSERT INTO `ventas_detalle` (`venta_id`, `producto_id`, `cantidad`, `precio`) VALUES (2, '8', 1, 10000)
SELECT *
FROM `productos`
WHERE `productos`.`id` = '8'
UPDATE `productos` SET `stock` = 4
WHERE `productos`.`id` IN ('8')