app/Models/Categoria_model.php

    public function getCategorias(){
        return $this->findAll();
---
SELECT *
FROM `categoria`