app/Models/Producto_model.php

public function getProductoAll(){
        $builder = $this->getBuilderProductos();
        // consulta a la base de datos para recuperar todos los registros por id, descendente
        $builder->select('*', 'id','DESC');
        return $this->findAll();
---
SELECT *
FROM `productos`

public function getActiveProductoAll(){
        $builder = $this->getBuilderProductos();
        // consulta a la base de datos para recuperar todos los registros por id, descendente
        $builder->select('*', 'id','DESC');
        return $this->where('eliminado', 'NO')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'